; domain
;; logistics domain
;;

(define (domain logistics)
  (:requirements :strips) 
  (:predicates 	(package ?obj)
	       	(truck ?truck)
		(airplane ?airplane)
                (airport ?airport)
               	(location ?loc)
		(in-city ?obj ?city)
                (city ?city)
		(at ?obj ?loc)
		(in ?obj ?obj))

 
(:action load-truck
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (package ?obj) (truck ?truck) (location ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action load-airplane
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (package ?obj) (airplane ?airplane) (location ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action unload-truck
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (package ?obj) (truck ?truck) (location ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action unload-airplane
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (package ?obj) (airplane ?airplane) (location ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action drive-truck
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (truck ?truck) (location ?loc-from) (location ?loc-to) (city ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action fly-airplane
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (airplane ?airplane) (airport ?loc-from) (airport ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-10-0)
(:domain logistics)
(:objects apn1 apn2 apt4 pos4 apt3 pos3 apt2 pos2 apt1 pos1 cit4 cit3 cit2 cit1 tru4 tru3 tru2 tru1 obj32 obj31)
(:init (package obj31) (package obj32) (truck tru1) (truck tru2)
 (truck tru3) (truck tru4) (city cit1) (city cit2) (city cit3) (city cit4)
 (location pos1) (location apt1) (location pos2) (location apt2) (location pos3)
 (location apt3) (location pos4) (location apt4) (airport apt1) (airport apt2)
 (airport apt3) (airport apt4) (airplane apn1) (airplane apn2) (at apn1 apt1) (at apn2 apt2) (at tru1 pos1)
; (at obj11 pos1) (at obj12 pos1) (at obj13 pos1) 
 (at tru2 pos2) (at obj21 pos2)
; (at obj22 pos2) (at obj23 pos2) 
 (at tru3 apt3) (at obj31 pos3) (at obj32 pos3)
; (at obj33 pos3) (at obj41 pos4) (at obj42 pos4) (at obj43 pos4)
 (at tru4 pos4) (in-city pos1 cit1) (in-city apt1 cit1) (in-city pos2 cit2) (in-city apt2 cit2) (in-city pos3 cit3) (in-city apt3 cit3) (in-city pos4 cit4) (in-city apt4 cit4))
(:goal (and (at obj31 pos3) (at obj32 pos1)))
; (:goal (at obj31 pos3))
)

; plan
1. (fly-airplane apn1 apt1 apt3)
   deleted: (at apn1 apt1)
   added: (at apn1 apt3)
   goals met: 1 of 2
2. (drive-truck tru3 apt3 pos3 cit3)
   deleted: (at tru3 apt3)
   added: (at tru3 pos3)
   goals met: 1 of 2
3. (load-truck obj32 tru3 pos3)
   deleted: (at obj32 pos3)
   added: (in obj32 tru3)
   goals met: 1 of 2
4. (drive-truck tru3 pos3 apt3 cit3)
   deleted: (at tru3 pos3)
   added: (at tru3 apt3)
   goals met: 1 of 2
5. (unload-truck obj32 tru3 apt3)
   deleted: (in obj32 tru3)
   added: (at obj32 apt3)
   goals met: 1 of 2
6. (load-airplane obj32 apn1 apt3)
   deleted: (at obj32 apt3)
   added: (in obj32 apn1)
   goals met: 1 of 2
7. (fly-airplane apn1 apt3 apt1)
   deleted: (at apn1 apt3)
   added: (at apn1 apt1)
   goals met: 1 of 2
8. (unload-airplane obj32 apn1 apt1)
   deleted: (in obj32 apn1)
   added: (at obj32 apt1)
   goals met: 1 of 2
9. (drive-truck tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 1 of 2
10. (load-truck obj32 tru1 apt1)
   deleted: (at obj32 apt1)
   added: (in obj32 tru1)
   goals met: 1 of 2
11. (drive-truck tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 1 of 2
12. (unload-truck obj32 tru1 pos1)
   deleted: (in obj32 tru1)
   added: (at obj32 pos1)
   goals met: 2 of 2
